In [215]:
import pyspark
import csv
from pyspark.sql import SparkSession

In [216]:
spark=SparkSession.builder.appName("Employess").getOrCreate()

Read Csv File with Spark

In [218]:
df_spark=spark.read.csv('employee_data.csv',header=True,inferSchema=True)

In [231]:


df_spark.printSchema()
df_spark.head()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: double (nullable = true)
 |-- Address: string (nullable = true)

Row(Name='surend', Age=20, Experience=2, Salary=20000.0, Address='Tn')

In [220]:
df_spark.show()

+------+----+----------+-------+-------+
|  Name| Age|Experience| Salary|Address|
+------+----+----------+-------+-------+
|surend|  20|         2|20000.0|     Tn|
| kumar|  21|         1|30000.0|     Kl|
|  hari|  23|         3|40000.0|     Tn|
|sudhan|  20|         5|   NULL|     Kr|
|  alex|NULL|         7|30000.0|     kl|
|   bob|  25|      NULL|10000.0|   NULL|
|  jhon|NULL|      NULL|   NULL|   NULL|
+------+----+----------+-------+-------+

In [221]:
df_spark.describe().show()

+-------+------+----------------+------------------+-----------------+-------+
|summary|  Name|             Age|        Experience|           Salary|Address|
+-------+------+----------------+------------------+-----------------+-------+
|  count|     7|               5|                 5|                5|      5|
|   mean|  NULL|            21.8|               3.6|          26000.0|   NULL|
| stddev|  NULL|2.16794833886788|2.4083189157584592|11401.75425099138|   NULL|
|    min|  alex|              20|                 1|          10000.0|     Kl|
|    max|surend|              25|                 7|          40000.0|     kl|
+-------+------+----------------+------------------+-----------------+-------+

In [222]:
# drop cloumns()
dpcloumn=df_spark.drop('Adress')

dpcloumn.show()

+------+----+----------+-------+-------+
|  Name| Age|Experience| Salary|Address|
+------+----+----------+-------+-------+
|surend|  20|         2|20000.0|     Tn|
| kumar|  21|         1|30000.0|     Kl|
|  hari|  23|         3|40000.0|     Tn|
|sudhan|  20|         5|   NULL|     Kr|
|  alex|NULL|         7|30000.0|     kl|
|   bob|  25|      NULL|10000.0|   NULL|
|  jhon|NULL|      NULL|   NULL|   NULL|
+------+----+----------+-------+-------+

In [223]:
# null values colums drops
df_spark.na.drop().show()

+------+---+----------+-------+-------+
|  Name|Age|Experience| Salary|Address|
+------+---+----------+-------+-------+
|surend| 20|         2|20000.0|     Tn|
| kumar| 21|         1|30000.0|     Kl|
|  hari| 23|         3|40000.0|     Tn|
+------+---+----------+-------+-------+

In [224]:
# drop specific any (how)
# how=all is to remove or print all values of Null
# how=any is to remove or print all values any colums of Null
df_spark.na.drop(how='any').show()

+------+---+----------+-------+-------+
|  Name|Age|Experience| Salary|Address|
+------+---+----------+-------+-------+
|surend| 20|         2|20000.0|     Tn|
| kumar| 21|         1|30000.0|     Kl|
|  hari| 23|         3|40000.0|     Tn|
+------+---+----------+-------+-------+

Thersold for fillter Null

In [225]:
# threshold 
# its remove to put the null values ex=2 any two null values columns is del
df_spark.na.drop(how='any',thresh=3).show()

+------+----+----------+-------+-------+
|  Name| Age|Experience| Salary|Address|
+------+----+----------+-------+-------+
|surend|  20|         2|20000.0|     Tn|
| kumar|  21|         1|30000.0|     Kl|
|  hari|  23|         3|40000.0|     Tn|
|sudhan|  20|         5|   NULL|     Kr|
|  alex|NULL|         7|30000.0|     kl|
|   bob|  25|      NULL|10000.0|   NULL|
+------+----+----------+-------+-------+

Subnet

In [226]:
# subset
# to remove the columns to specific null values
df_spark.na.drop(how='any',subset=['Experience']).show()

+------+----+----------+-------+-------+
|  Name| Age|Experience| Salary|Address|
+------+----+----------+-------+-------+
|surend|  20|         2|20000.0|     Tn|
| kumar|  21|         1|30000.0|     Kl|
|  hari|  23|         3|40000.0|     Tn|
|sudhan|  20|         5|   NULL|     Kr|
|  alex|NULL|         7|30000.0|     kl|
+------+----+----------+-------+-------+

In [239]:
# filling the Missing Value
df_spark.na.fill("Missing Values","Experience").show()

+------+----+----------+-------+-------+
|  Name| Age|Experience| Salary|Address|
+------+----+----------+-------+-------+
|surend|  20|         2|20000.0|     Tn|
| kumar|  21|         1|30000.0|     Kl|
|  hari|  23|         3|40000.0|     Tn|
|sudhan|  20|         5|   NULL|     Kr|
|  alex|NULL|         7|30000.0|     kl|
|   bob|  25|      NULL|10000.0|   NULL|
|  jhon|NULL|      NULL|   NULL|   NULL|
+------+----+----------+-------+-------+

In [228]:
df_spark.dtypes
df_spark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: double (nullable = true)
 |-- Address: string (nullable = true)

Imputer Ml library Feature

In [240]:
from pyspark.ml.feature import Imputer
imputer=Imputer(
    inputCols=['Age','Experience','Salary'],
    outputCols=["{}_imputed".format(c) for c in ['Age','Experience','Salary']],
).setStrategy("median")

In [241]:
# add imputation cols to df
imputer.fit(df_spark).transform(df_spark).show()

+------+----+----------+-------+-------+-----------+------------------+--------------+
|  Name| Age|Experience| Salary|Address|Age_imputed|Experience_imputed|Salary_imputed|
+------+----+----------+-------+-------+-----------+------------------+--------------+
|surend|  20|         2|20000.0|     Tn|         20|                 2|       20000.0|
| kumar|  21|         1|30000.0|     Kl|         21|                 1|       30000.0|
|  hari|  23|         3|40000.0|     Tn|         23|                 3|       40000.0|
|sudhan|  20|         5|   NULL|     Kr|         20|                 5|       30000.0|
|  alex|NULL|         7|30000.0|     kl|         21|                 7|       30000.0|
|   bob|  25|      NULL|10000.0|   NULL|         25|                 3|       10000.0|
|  jhon|NULL|      NULL|   NULL|   NULL|         21|                 3|       30000.0|
+------+----+----------+-------+-------+-----------+------------------+--------------+

Filter Operrations

In [243]:
# salary of the people less then or equal to 20000
df_spark.filter("Salary<=20000").show()

+------+---+----------+-------+-------+
|  Name|Age|Experience| Salary|Address|
+------+---+----------+-------+-------+
|surend| 20|         2|20000.0|     Tn|
|   bob| 25|      NULL|10000.0|   NULL|
+------+---+----------+-------+-------+

In [244]:
df_spark.filter("Salary<=20000").select(["Name",'Age']).show()

+------+---+
|  Name|Age|
+------+---+
|surend| 20|
|   bob| 25|
+------+---+

In [246]:
df_spark.filter(df_spark['Salary']<=20000).show()

+------+---+----------+-------+-------+
|  Name|Age|Experience| Salary|Address|
+------+---+----------+-------+-------+
|surend| 20|         2|20000.0|     Tn|
|   bob| 25|      NULL|10000.0|   NULL|
+------+---+----------+-------+-------+

In [251]:
df_spark.filter((df_spark['Salary']<=30000)&(df_spark['Salary']<=20000)).show()

+------+---+----------+-------+-------+
|  Name|Age|Experience| Salary|Address|
+------+---+----------+-------+-------+
|surend| 20|         2|20000.0|     Tn|
|   bob| 25|      NULL|10000.0|   NULL|
+------+---+----------+-------+-------+

In [252]:
df_spark.filter(~(df_spark['Salary']<=20000)).show()

+-----+----+----------+-------+-------+
| Name| Age|Experience| Salary|Address|
+-----+----+----------+-------+-------+
|kumar|  21|         1|30000.0|     Kl|
| hari|  23|         3|40000.0|     Tn|
| alex|NULL|         7|30000.0|     kl|
+-----+----+----------+-------+-------+